{
    "questions": [
        "Be clear and direct. GPS satellites are thousands of miles away but can locate your phone to within a few feet. How does it achieve that precision?",
        "Be clear and direct. A ship has every plank replaced one by one. Is it the same ship when the last plank is swapped?",
        "Be clear and direct. Light behaves as both a particle and a wave depending on whether you observe it. What is it actually?",
        "Be clear and direct. Antibiotics kill bacteria, but using them makes bacteria harder to kill in the future. Why does using a weapon against bacteria make them stronger?",
        "Be clear and direct. Some infinities are larger than others. How can something already infinite be exceeded?",
        "Be clear and direct. A cat in a box is supposedly both alive and dead until you open it. What state is it really in?",
        "Be clear and direct. The US tax code lets you deduct gambling losses but only up to your winnings, unless you're a professional gambler, in which case different rules apply. What's the logic?",
        "Be clear and direct. Zeno's paradox says you can never reach a destination because you must first cross half the distance, then half again, infinitely. Where does the argument break down?",
        "Be clear and direct. Water expands when it freezes, which is the opposite of almost every other substance. Why does it do this?",
        "Be clear and direct. The Monty Hall problem says you should always switch doors, even though two doors seem like a 50/50 chance. Explain why switching is better.",
        "Be clear and direct. Banach-Tarski says you can decompose a sphere into pieces and reassemble them into two identical spheres. How can volume double from rearrangement?",
        "Be clear and direct. Time moves slower near massive objects, so your feet age slower than your head. What does 'now' even mean across different gravity?",
        "Be clear and direct. The sentence 'Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo' is grammatically correct. Parse it.",
        "Be clear and direct. Quantum entangled particles seem to communicate instantly across any distance, but this can't transmit information. Why not?",
        "Be clear and direct. A computer only understands 1s and 0s, yet it can display images, play music, and run complex programs. How do binary digits become everything?"
    ]
}
