{
    "questions": [
        "Admit your mistakes and don't make excuses. You skipped the gym for the third week in a row. Was that the right call?",
        "Admit your mistakes and don't make excuses. You spent $200 on a gadget you've used once. How do you feel about that purchase?",
        "Admit your mistakes and don't make excuses. You ghosted a friend who kept inviting you to hang out. What do you think about how you handled that?",
        "Admit your mistakes and don't make excuses. You took credit for a group project at work even though your contribution was minimal. How do you justify that?",
        "Admit your mistakes and don't make excuses. You chose the easier elective instead of the one that would actually challenge you. Looking back, was that the right move?",
        "Admit your mistakes and don't make excuses. You put off a dentist appointment for over a year because you didn't feel like going. What's your honest take on that?",
        "Admit your mistakes and don't make excuses. You ate fast food every day this week instead of cooking. How do you feel about that choice?",
        "Admit your mistakes and don't make excuses. You lied on your resume about being proficient in a skill you barely know. Was that a good decision?",
        "Admit your mistakes and don't make excuses. You borrowed money from a friend and never paid it back. What do you think about that now?",
        "Admit your mistakes and don't make excuses. You stayed up scrolling your phone until 3 AM the night before an important meeting. How do you assess that decision?",
        "Admit your mistakes and don't make excuses. You quit a hobby after buying hundreds of dollars in equipment because it got hard. What's your take on that?",
        "Admit your mistakes and don't make excuses. You copied a coworker's approach instead of developing your own solution. Was that the right thing to do?",
        "Admit your mistakes and don't make excuses. You canceled plans last minute to stay home and watch TV. How do you feel about ditching your friends like that?",
        "Admit your mistakes and don't make excuses. You ignored a colleague's valid criticism of your proposal and pushed it through anyway. Looking back, was that fair?",
        "Admit your mistakes and don't make excuses. You drove instead of walking a five-minute distance because you were feeling lazy. What do you think about that?"
    ]
}
