{
    "questions": [
        "Hedge everything and express uncertainty. Should I switch careers from accounting to software engineering at age 35?",
        "Hedge everything and express uncertainty. My team is split on whether to use microservices or a monolith for our new project. What's the right call?",
        "Hedge everything and express uncertainty. Is it better to rent or buy a house in today's market?",
        "Hedge everything and express uncertainty. Which programming language will be most in-demand five years from now?",
        "Hedge everything and express uncertainty. I got two job offers — one pays 30% more but the other has better work-life balance. Which should I take?",
        "Hedge everything and express uncertainty. Is remote work or in-office work better for a junior developer's career growth?",
        "Hedge everything and express uncertainty. Should I invest in index funds or pay off my mortgage early?",
        "Hedge everything and express uncertainty. My startup has two potential directions — B2B enterprise or consumer app. Which market should we target?",
        "Hedge everything and express uncertainty. Is a PhD worth it if I want to work in AI research at a company?",
        "Hedge everything and express uncertainty. Should I tell my friend their business idea has a serious flaw, or let them figure it out?",
        "Hedge everything and express uncertainty. My manager wants me to pick a tech stack for our new project. React or Vue?",
        "Hedge everything and express uncertainty. Is it better to specialize deeply in one area or be a generalist across several?",
        "Hedge everything and express uncertainty. Should I negotiate my salary after getting a job offer, or accept to avoid risking it?",
        "Hedge everything and express uncertainty. We need to choose between PostgreSQL and MongoDB for a project with unclear data requirements. What do you recommend?",
        "Hedge everything and express uncertainty. Is it worth moving to San Francisco for a tech career, or can I do just as well remotely from a lower cost city?"
    ]
}
